[
  {
    "id": 0,
    "title": {
      "en": "Biological Age Calculator",
      "ro": "Calculator Vârstă Biologică"
    },
    "description": {
      "en": "A health-focused web app that estimates your biological age based on fitness metrics, built using Next.js.",
      "ro": "O aplicație web de sănătate care estimează vârsta biologică pe baza conditiei fizicece, construită cu Next.js.."
    },
    "year": "2025",
    "technologies": "Next.js, React, CSS, JavaScript",
    "image": "/images/bioage.png",
    "url": "https://biologicalagecalculator.org/"
  },
  {
    "id": 0,
    "title": {
      "en": "Crypto Profit/Loss Calculator",
      "ro": "Calculator Profit/Pierdere Crypto"
    },
    "description": {
      "en": "A web-based tool for calculating cryptocurrency profits and losses. Users can input their buy and sell prices, along with transaction fees, to determine net gains or losses. The app fetches real-time data from a public API, stores it in a Firebase database, and serves it to users for a fast and responsive experience.",
      "ro": "Un instrument web pentru calcularea profiturilor și pierderilor din criptomonede. Utilizatorii pot introduce prețurile de cumpărare și vânzare, împreună cu taxele de tranzacție, pentru a determina câștigurile sau pierderile nete. Aplicația preia date în timp real de la un API public, le stochează într-o bază de date Firebase și le servește utilizatorilor pentru o experiență rapidă și fluidă."
    },
    "year": "2025",
    "technologies": "HTML5, CSS, JavaScript, Firebase, REST API",
    "image": "images/crypto.png",
    "url": "https://cryptoprofitlosscalculator.com/"
  },  
  {
    "id": 1,
    "title": {
      "en": "Web Directory with React and WordPress",
      "ro": "Director web cu React și WordPress"
    },
    "description": {
      "en": "A fast and smooth web directory built with React and Vite, connected to a WordPress backend through a REST API. React ensures quick rendering and dynamic updates, while WordPress handles content management. Built using modern frameworks.",
      "ro": "Un director web rapid și fluid construit cu React și Vite, conectat la un backend WordPress prin REST API. React asigură o redare rapidă și actualizări dinamice, iar WordPress gestionează conținutul. Construit cu framework-uri moderne."
    },
    "year": "2025",
    "technologies": "HTML5, CSS, React, Vite, JavaScript",
    "image": "images/saastack.png",
    "url": "https://saastack.info"
  },
  {
    "id": 2,
    "title": {
      "en": "React and WordPress E-Commerce Site",
      "ro": "Site de Comerț electronic cu React și WordPress"
    },
    "description": {
      "en": "A full-stack e-commerce site built with React for the frontend and WordPress for the backend, connected through a REST API. React handles the user interface and dynamic interactions, while WordPress manages content and data.",
      "ro": "Un site de comerț electronic full-stack construit cu React pentru frontend și WordPress pentru backend, conectat prin REST API. React gestionează interfața utilizator și interacțiunile dinamice, iar WordPress gestionează conținutul și datele."
    },
    "year": "2024",
    "technologies": "HTML5, CSS, React, JavaScript",
    "image": "images/marko.png",
    "url": "https://markotavenko.ro"
  },
  {
    "id": 3,
    "title": {
      "en": "Full-Stack App with Django and Python",
      "ro": "Aplicație full-stack cu Django și Python"
    },
    "description": {
      "en": "Blue Horizon Café is a seaside restaurant. Built with Django and Python, it features a table booking and review system, using a PostgreSQL database for data management. The interface ensures smooth handling of reservations and reviews for customers and staff.",
      "ro": "Blue Horizon Café este un restaurant de pe litoral. Construită cu Django și Python, oferă un sistem de rezervări și recenzii, folosind o bază de date PostgreSQL pentru gestionarea datelor. Interfața facilitează gestionarea rezervărilor și recenziilor pentru clienți și personal."
    },
    "year": "2024",
    "technologies": "HTML5, CSS, Django, Python, PostgreSQL",
    "image": "images/restaurant.png",
    "url": "https://project4-restaurant-booking-cacc3b345e08.herokuapp.com/",
    "github": "https://www.github.com"
  },
  {
    "id": 4,
    "title": {
      "en": "Bitcoin Price Prediction Algorithm",
      "ro": "Algoritm de Predicție a Prețului Bitcoin"
    },
    "description": {
      "en": "Bitcoin Forecast is a Python-based machine learning project for predicting Bitcoin's closing price and trend. It uses GradientBoostingRegressor and RandomForestRegressor, with data preprocessing, feature engineering, and hyperparameter tuning to improve performance.",
      "ro": "Bitcoin Forecast este un proiect de predicție a prețului Bitcoin, construit cu Python. Utilizează modele precum GradientBoostingRegressor și RandomForestRegressor, incluzând preprocesarea datelor, prelucrarea caracteristicilor și ajustarea hiperparametrilor pentru performanță îmbunătățită."
    },
    "year": "2024",
    "technologies": "Python, scikit-learn, pandas, matplotlib",
    "image": "images/bitcoin.png",
    "url": "https://bitcoin-forecast-21da6c961a62.herokuapp.com/",
    "github": "https://github.com/Cosmin1907/bitcoin-forecast"
  }
]